Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.localTmux.output.noStale
source: No stale local tmux sessions
ar: لا توجد جلسات tmux محلية قديمة
de: Keine veralteten lokalen tmux-Sitzungen
es: No hay sesiones locales de tmux inactivas
fr: Aucune session tmux locale obsolète
ja: 古い local tmux セッションはありません
ko: 오래된 로컬 tmux 세션이 없습니다.
zh_hans: 无陈旧的本地 tmux 会话
zh_hant: 無過期的本機 tmux 工作階段

# cli.localTmux.output.record
source: OK session=%@ id=%@ state=%@ socket=%@
ar: موافق session=%@ id=%@ state=%@ socket=%@

# cli.localTmux.output.removedStale
source: Removed %lld stale local tmux sessions
ar: تم إزالة %lld من جلسات tmux المحلية القديمة
de: %lld veraltete lokale tmux-Sitzungen entfernt
es: Se eliminaron %lld sesiones locales de tmux obsoletas
fr: Supprimé %lld sessions tmux locales périmées
ja: %lld 個の不要なローカル tmux セッションを削除しました
ko: %lld개의 오래된 로컬 tmux 세션을 제거했습니다.
zh_hans: 已移除 %lld 个陈旧的本地 tmux 会话
zh_hant: 已移除 %lld 個過期的本機 tmux 工作階段

# cli.localTmux.state.detached
source: detached
ar: منفصل
de: Abgekoppelt
es: Desvinculado
fr: Détaché
ja: 切断済み
ko: 분리됨
zh_hans: 已分离
zh_hant: 已分離

# cli.localTmux.state.live
source: live
ar: نشط
de: aktiv
es: activa
fr: actif
ja: 稼働中
ko: 실행 중
zh_hans: 活跃
zh_hant: 作用中

# cli.localTmux.state.stale
source: stale
ar: قديم
de: veraltet
es: inactiva
fr: obsolète
ja: 古い
ko: 오래됨
zh_hans: 陈旧
zh_hant: 過期

# cli.localTmux.state.unknown
source: unknown
ar: مجهول
de: unbekannt
es: desconocido
fr: inconnu
ja: 不明
ko: 알려지지 않은
zh_hans: 未知
zh_hant: 未知

# cli.localTmux.target.pane
source: pane
ar: جزء
de: Teilfenster
es: panel
fr: volet
ja: ペイン
ko: 분할 창
zh_hans: 窗格
zh_hant: 窗格

# cli.localTmux.target.surface
source: surface
ar: سطح
de: Oberfläche
es: superficie
fr: surface d’affichage
ja: サーフェス
ko: 화면
zh_hans: 表面
zh_hant: 介面

# cli.localTmux.usage
source: Usage: cmux local-tmux <start|attach|list|status|detach|close|cleanup> [session] [options] Opt-in local tmux sessions survive cmux quit, crash, and app updates. Ordinary cmux terminals are unchanged. start <name> [--cwd <path>] [--command <shell>] [--detached] attach <name|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <name|--id <uuid>> [--json] detach <name|--id <uuid>> [--client <id> | --all] close <name|--id <uuid>> cleanup [--prune] The registry and tmux server socket live under ~/.cmux/local-tmux with user-only permissions. `attach --headless` hands the terminal directly to tmux for a client outside the cmux GUI.
ar: الاستخدام: cmux local-tmux <start|attach|list|status|detach|close|cleanup> [session] [options] جلسات tmux المحلية الاختيارية تظل نشطة بعد إنهاء cmux، والانهيار، وتحديثات التطبيق. لا تتغير طرفيات cmux العادية. start <name> [--cwd <path>] [--command <shell>] [--detached] attach <name|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <name|--id <uuid>> [--json] detach <name|--id <uuid>> [--client <id> | --all] close <name|--id <uuid>> cleanup [--prune] يعيش السجل ومقبس خادم tmux تحت ~/.cmux/local-tmux بصلاحيات للمستخدم فقط. يسلّم `attach --headless` الطرفية مباشرة إلى tmux لعميل خارج واجهة cmux الرسومية.
de: Verwendung: cmux local-tmux <start|attach|list|status|detach|close|cleanup> [Sitzung] [Optionen] Opt-in lokale tmux-Sitzungen überstehen das Beenden von cmux, Abstürze und App-Updates. Normale cmux-Terminals bleiben unverändert. start <Name> [--cwd <Pfad>] [--command <Shell>] [--detached] attach <Name|--id <UUID>> [--workspace <ID|Ref|Index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <Name|--id <UUID>> [--json] detach <Name|--id <UUID>> [--client <ID> | --all] close <Name|--id <UUID>> cleanup [--prune] Die Registrierung und der tmux-Server-Socket befinden sich unter ~/.cmux/local-tmux mit Berechtigungen nur für den Benutzer. `attach --headless` übergibt das Terminal direkt an tmux für einen Client außerhalb der cmux-GUI.
es: Uso: cmux local-tmux <start|attach|list|status|detach|close|cleanup> [session] [options] Las sesiones locales de tmux opcionales sobreviven a cierres, fallos y actualizaciones de la aplicación cmux. Las terminales ordinarias de cmux no cambian. start <name> [--cwd <path>] [--command <shell>] [--detached] attach <name|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <name|--id <uuid>> [--json] detach <name|--id <uuid>> [--client <id> | --all] close <name|--id <uuid>> cleanup [--prune] El registro y el socket del servidor de tmux residen en ~/.cmux/local-tmux con permisos exclusivos del usuario. `attach --headless` entrega la terminal directamente a tmux para un cliente fuera de la interfaz gráfica de cmux.
fr: Utilisation : cmux local-tmux <start|attach|list|status|detach|close|cleanup> [session] [options] Les sessions tmux locales optionnelles survivent à l'arrêt, au plantage et aux mises à jour de cmux. Les terminaux ordinaires de cmux restent inchangés. start <nom> [--cwd <chemin>] [--command <shell>] [--detached] attach <nom|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <nom|--id <uuid>> [--json] detach <nom|--id <uuid>> [--client <id> | --all] close <nom|--id <uuid>> cleanup [--prune] Le registre et le socket du serveur tmux résident sous ~/.cmux/local-tmux avec des permissions réservées à l'utilisateur. `attach --headless` transmet le terminal directement à tmux pour un client extérieur à l'interface graphique de cmux.
ja: 使い方: cmux local-tmux <start|attach|list|status|detach|close|cleanup> [セッション] [オプション] オプトインしたローカル tmux セッションは cmux の終了、クラッシュ、アップデート後も維持されます。通常の cmux ターミナルの動作は変わりません。 start <name> [--cwd <path>] [--command <shell>] [--detached] attach <name|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <name|--id <uuid>> [--json] detach <name|--id <uuid>> [--client <id> | --all] close <name|--id <uuid>> cleanup [--prune] レジストリと tmux サーバーソケットは ~/.cmux/local-tmux にユーザー専用権限で保存されます。`attach --headless` は cmux GUI 外のクライアントを tmux に直接接続します。
ko: 사용법: cmux local-tmux <start|attach|list|status|detach|close|cleanup> [session] [options] 선택하여 사용하는 로컬 tmux 세션은 cmux 종료, 충돌 및 앱 업데이트 후에도 유지됩니다. 일반 cmux 터미널은 변경되지 않습니다. start <name> [--cwd <path>] [--command <shell>] [--detached] attach <name|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <name|--id <uuid>> [--json] detach <name|--id <uuid>> [--client <id> | --all] close <name|--id <uuid>> cleanup [--prune] 레지스트리 및 tmux 서버 소켓은 사용자 전용 권한으로 ~/.cmux/local-tmux 아래에 저장됩니다. `attach --headless`는 cmux GUI 외부의 클라이언트를 위해 터미널을 tmux에 직접 전달합니다.
zh_hans: 用法: cmux local-tmux <start|attach|list|status|detach|close|cleanup> [session] [options] 选择加入的本地 tmux 会话在 cmux 退出、崩溃和应用更新时仍能存活。普通的 cmux 终端不受影响。 start <name> [--cwd <path>] [--command <shell>] [--detached] attach <name|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <name|--id <uuid>> [--json] detach <name|--id <uuid>> [--client <id> | --all] close <name|--id <uuid>> cleanup [--prune] 注册表和 tmux 服务器套接字位于具有仅用户权限的 ~/.cmux/local-tmux 下。`attach --headless` 会将终端直接移交给 tmux，以便在 cmux GUI 之外运行客户端。
zh_hant: 用法：cmux local-tmux <start|attach|list|status|detach|close|cleanup> [session] [options] 選擇加入的本機 tmux 工作階段在 cmux 結束、當機和軟體更新後仍能保留。一般的 cmux 終端機則不受影響。 start <name> [--cwd <path>] [--command <shell>] [--detached] attach <name|--id <uuid>> [--workspace <id|ref|index>] [--focus <true|false>] [--headless] [--new-client] list [--json] status <name|--id <uuid>> [--json] detach <name|--id <uuid>> [--client <id> | --all] close <name|--id <uuid>> cleanup [--prune] 註冊表與 tmux 伺服器 socket 位於 ~/.cmux/local-tmux 下，並具有僅限使用者存取的權限。`attach --headless` 會將終端機直接交給 tmux，以在 cmux GUI 之外使用用戶端。`
